import { Injectable } from '@angular/core';

@Injectable()
export class ErrorHandlingService {
    //该service 用户处理错误信息
    constructor() {}

    public getMsg(err: any) {
        let json = {
            code: 1,
            message: '',
        }
        //如果为页面内显示 code值为2 
        if (err.retCode && this.page.indexOf(err.retCode) != -1) {
            json.code = 2;
            json['retCode'] = err.retCode;
        }
        if (err.errMessage || this.isString(err)) {
            json.code = 2;
            json.message = err.errMessage || err;
        }
        if (err.msgDes) {
            json.message = err.msgDes
        } else {
            json.message = this.zh[err.retCode] || '系统繁忙，请刷新后重试!';
        }
        return json;
    }

    isString(str: any){ 
        return (typeof str == 'string') && str.constructor == String; 
    }

    //页面内显示
    page: any[] = [
        5001,
        5502,
        5504,
        6504,
        6505,
        6529,
        8000,
        8001,
        8002,
        9001,
        10501
    ];
    //右上角显示 TODO 占时没用 只判断在页面内显示不在页面内显示全在右上角
    topRightRorner: any[] = [];

    zh = {
        //campaign
        5001: '营销活动名称重复',
        5002: '活动已经开始不能删除',

        5005: '未设置活动时间',
        5006: '设置活动时间范围不对',

        //campagin unit
        5500: '附件没有找到',
        5501: '人群类型不存在',
        5502: '人群名称不能为空',
        5503: '活动id不能为空',
        5504: '同一个活动下，人群名称重复',
        5505: '调用用户管家接口创建人群失败',
        5506: '从用户管家获取历史人群为空, refId:{0}',
        5507: '从用户管家获取历史人群状态为未完成, refId:{0}',
        5508: '从用户管家获取历史人群的预估规模为空, refId:{0}',
        5509: '起始时间和结束时间为空',
        5510: '投放单元不存在',
        5511: '所属活动不存在，不能删除',
        5512: '活动时间不存在',
        5513: '活动已经结束，不能删除',
        5514: '投放单元所属人群正在计算中',
        5515: '有投放进行中或已结束，不能删除',
        5516: '投放单元所属人群为空',
        5517: '投放单元所属人群已是最新，不能发起计算',
        5518: '场景人群，计算完成不能发起重新计算。',
        5519: '重新计算失败',
        5520: 'campaignLaunchUnitExtendPage参数不存在',
        5521: 'campaignLaunchUnitExtendPage格式错误',
        5522: '一方ID上传人群不允许进行重新计算',
        5528: '附件格式错误',
        5529: '人群名称重复',
        
        //crowd
        6000: '人群不存在, crowdId:{0}',
        6001: '附件没有找到, crowdId:{0}',
        6002: '文件中第{0}行{1}字段含义异常，请修正后重新上传文件',
        6003: '人群未计算完成',
        6004: 'calcId不存在!',
        6005: 'calcStatus不存在',
        6006: '计算未完成，不能导出',
        6007: '从用户管家发起下载任务失败',
        6008: '没有找到用户或者租户信息',
        6009: '人群状态不存在',
        6010: '人群计算失败不能导出',

        //segment
        6500: '通道类型不存在',
        6501: '活动id不能为空',
        6502: '活动单元id不能为空',
        6503: '人群id不能为空',
        6504: '投放名称不能为空',
        6505: '投放状态不能为空',
        6606: '投放状态必须为草稿或者等待中',
        6507: '投放类型parse错误',
        6508: '投放类型错误',
        6509: '投放时间不能为空',
        6510: '按{0}循环，{1}不能为空',
        6511: '天',
        6512: '周',
        6513: '月',
        6514: '小时',
        6515: '分钟',
        6516: 'message不能为空',
        6517: 'message格式错误',
        6518: 'message内容不能为空',
        6519: 'ab推送总流量不等于100%',
        6520: 'app不能为空',
        6521: 'os只能为a或i',
        6522: '推送类型错误',
        6523: '非静默推送title不能为空',
        6524: '非静默推送content不能为空',
        6525: '投放渠道code不能为空',
        6526: 'channel type不能为空',
        6527: '投放没有找到',
        6528: '投放id不能为空',
        6529: '投放名称重复',

        //登录信息
        7000: '没有找到用户或者租户信息',
        7001: '没有找到租户ID',
        7002: '没有找到用户邮箱',
        7003: '没有找到用户名',

        //user cloud api
        7500: '用户管家接口返回错误',
        7501: '用户管家接口获取cube定义返回错误',
        7502: '获取用户管家cube结果失败',
        7503: '没有找到对应的cube信息',
        7504: '从用户管家获取人群列表失败',
        7505: '从用户管家获取人群信息失败',

        //file check
        8000: '请导入csv文件',
        8001: '请导入非空csv文件',
        8002: '请导入UTF-8编码的文件',

        //CampaignFunnelConfig
        8500: '没有找到活动',
        8501: '起始页为1',
        8502: '只能选择两个事件',

        //funnel definition
        9000: '活动漏斗定义id没有找到',
        9001: '漏斗名称重复',
        9002: '漏斗不存在',

        //campaign target configs
        9500: '活动目标已经存在',

        //campaign target definition
        10000: '查询当前活动未配置目标异常，请稍后再试',
        11500: '组件ID重复',
        11510: '流程没有测试通过不允许申请上线',
        11511: '只有草稿、已下线、审批未通过的营销流程可以修改',
        11512: '只有草稿状态的营销流程可以测试',
        11513: '流程名称重复',
        11514: '流程时间范围不对',
        11516: '流程中存在未连线算子',
        11517: '分支未结束',
        11518: '流程应以入口算子开始',
        //事件相关配置
        12500: '事件名称重复'
    };
}